<a target="_blank" href="https://colab.research.google.com/github/lukebarousse/Int_SQL_Data_Analytics_Course/blob/main/3_Windows_Functions/5_Frame_Clause.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

# Frame Clause

## Overview

### 🥅 Analysis Goals

- **Monthly Revenue Trends:** Calculate the running average monthly revenue and the preceding monthly average net revenue.
- **Mid-Term Revenue Patterns:** Compute rolling 3-month revenue average to smooth monthly fluctuations and reveal purchasing behaviors.  
- **Comparing Monthly Revenues**: Calculates average revenue across all months and compare the last month and the third month revenues.

### 📘 Concepts Covered

- `CURRENT ROW`
- `N PRECEDING` 
- `N FOLLOWING` 
- `UNBOUNDED`
    - `UNBOUNDED PRECEDING`
    - `UNBOUNDED FOLLOWING`

---

In [1]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# If running in Google Colab, install PostgreSQL and restore the database
if 'google.colab' in sys.modules:
    # Install PostgreSQL
    !sudo apt-get install postgresql -qq > /dev/null 2>&1

    # Start PostgreSQL service (suppress output)
    !sudo service postgresql start > /dev/null 2>&1

    # Set password for the 'postgres' user to avoid authentication errors (suppress output)
    !sudo -u postgres psql -c "ALTER USER postgres WITH PASSWORD 'password';" > /dev/null 2>&1

    # Create the 'colab_db' database (suppress output)
    !sudo -u postgres psql -c "CREATE DATABASE contoso_100k;" > /dev/null 2>&1

    # Download the PostgreSQL .sql dump
    !wget -q -O contoso_100k.sql https://github.com/lukebarousse/Int_SQL_Data_Analytics_Course/releases/download/v.0.0.0/contoso_100k.sql

    # Restore the dump file into the PostgreSQL database (suppress output)
    !sudo -u postgres psql contoso_100k < contoso_100k.sql > /dev/null 2>&1

    # Shift libraries from ipython-sql to jupysql
    !pip uninstall -y ipython-sql > /dev/null 2>&1
    !pip install jupysql > /dev/null 2>&1

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:password@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

---
## ROWS, RANGE, GROUPS

[Postgres Source Documentation on Window Function Calls](https://www.postgresql.org/docs/current/sql-expressions.html#:~:text=%5B%20frame_clause%20%5D)

#### `ROWS`

- Defines window frame based on physical row position
- Counts actual rows before/after current row
- Provides precise control over row inclusion

```sql
<window function> OVER (
    PARTITION BY column
    ORDER BY column
    ROWS start_frame
)

```

```sql
<window function> OVER (
    PARTITION BY column
    ORDER BY column
    ROWS BETWEEN start_frame AND end_frame
)
```

#### `start_frame` & `end_frame`

**Start Frame & End Frame:**
- `CURRENT ROW`: Just the current row (simplest)
- `UNBOUNDED PRECEDING`: All rows from start to current row
- `UNBOUNDED FOLLOWING`: All rows from current to end
- `N PRECEDING`: N rows before current row 
- `N FOLLOWING`: N rows after current row


```sql
UNBOUNDED PRECEDING
N PRECEDING
CURRENT ROW
N FOLLOWING
UNBOUNDED FOLLOWING
```

#### `RANGE` & `GROUP`

**RANGE**
- Defines window frame based on logical value ranges rather than physical rows
- Useful for time-series data where you want to group by value ranges (e.g. date ranges)
- Treats rows with equal ORDER BY values as a single group

**GROUPS**
- Groups rows that share the same values in the ORDER BY column
- Useful when you want to treat tied values as a single unit


```sql
<window function> OVER (
    PARTITION BY column
    ORDER BY column
    { RANGE | GROUPS } BETWEEN start_frame AND end_frame
)
```

**Why we aren't covering `RANGE` & `GROUP`?**
- 📊 RANGE and GROUPS are less commonly used in practice compared to ROWS
- 🔍 ROWS is more intuitive and sufficient for most window function use cases
- ⚠️ Some databases don't support RANGE and GROUPS (e.g. MySQL)
- ⚡ ROWS provides better performance in most cases  

| SQL Feature | PostgreSQL | MySQL | SQL Server | Oracle | Snowflake | BigQuery |
|------------|------------|--------|------------|--------|------------|----------|
| **ROWS**  | ✅ | ✅ | ✅ | ✅ | ✅ | ✅ |
| **RANGE** | ✅ | ❌ | ✅ | ✅ | ✅ | ✅ |
| **GROUPS** | ✅ | ❌ | ❌ | ✅ | ✅ | ✅ |

---

## CURRENT ROW

### 📝 Notes

`CURRENT ROW`

- **CURRENT ROW**: Refers to the current row in a window frame during a query execution.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN CURRENT ROW AND CURRENT ROW
    ) AS window_column_alias
  FROM table_name;
  ```
> **NOTE:** using `ROWS BETWEEN CURRENT ROW AND CURRENT ROW` is redundant and practically useless in SQL window functions. It essentially means the window consists of just the current row, which is the same as using `SUM(column_name) OVER (...)` without specifying `ROWS`.

### 🔑 Key Concepts
- **📊 Business Terms**: 
  - Individual Order Value: Revenue from a single transaction
  - Point-in-Time Analysis: Examining metrics at a specific moment
  - Transaction-Level Detail: Granular view of each sale
- **💡 Why It Matters**: Enables precise analysis of individual order performance
    - Identifies specific high-value or low-value transactions
    - Helps spot anomalies in order patterns
    - Helps isolate daily performance trends for each cohort without being influenced by revenue on other days.
- **🎯 Common Use Cases**: Transaction monitoring, order analysis
- **📈 Related KPIs**: Order value, transaction frequency

### 📈 Analysis

- Calculates the monthly running average net revenue.

### Monthly Sales Analysis

**`CURRENT ROW`**

1. Calculate monthly revenue for 2023
   - Extract month from orderdate using `TO_CHAR()`
   - Calculate revenue using `quantity * netprice * exchangerate`
   - Filter for year 2023
   - Group and order by month

In [5]:
%%sql

SELECT 
    TO_CHAR(orderdate, 'YYYY-MM') as month,
    SUM(quantity * netprice * exchangerate) as net_revenue
FROM sales
WHERE EXTRACT(YEAR FROM orderdate) = 2023
GROUP BY month
ORDER BY month

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

12 rows affected.

      month  net_revenue
0   2023-01   3664431.34
1   2023-02   4465204.57
2   2023-03   2244316.52
3   2023-04   1162796.16
4   2023-05   2943005.99
5   2023-06   2864500.03
6   2023-07   2337639.34
7   2023-08   2623919.79
8   2023-09   2622774.85
9   2023-10   2551322.61
10  2023-11   2700103.38
11  2023-12   2928550.93

2. Calculate monthly revenue with `CURRENT ROW` frame
   - Use CTE to store monthly revenue calculation
   - Calculate revenue using `AVG()` window function
   - Use `ROWS BETWEEN CURRENT ROW AND CURRENT ROW` frame
   - Compare original revenue with windowed calculation

In [6]:
%%sql

WITH monthly_sales AS (
    SELECT 
        TO_CHAR(orderdate, 'YYYY-MM') as month,
        SUM(quantity * netprice * exchangerate) as net_revenue
    FROM sales
    WHERE EXTRACT(YEAR FROM orderdate) = 2023
    GROUP BY month
    ORDER BY month
    
)
SELECT 
    month,
    net_revenue,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS CURRENT ROW -- ROWS BETWEEN CURRENT ROW AND CURRENT ROW
        ) as net_revenue_current
FROM monthly_sales;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

12 rows affected.

      month  net_revenue  net_revenue_current
0   2023-01   3664431.34           3664431.34
1   2023-02   4465204.57           4465204.57
2   2023-03   2244316.52           2244316.52
3   2023-04   1162796.16           1162796.16
4   2023-05   2943005.99           2943005.99
5   2023-06   2864500.03           2864500.03
6   2023-07   2337639.34           2337639.34
7   2023-08   2623919.79           2623919.79
8   2023-09   2622774.85           2622774.85
9   2023-10   2551322.61           2551322.61
10  2023-11   2700103.38           2700103.38
11  2023-12   2928550.93           2928550.93

---

## N PRECEDING

`PRECEDING`

- **N PRECEDING**: Refers to `N` rows before the current row in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN N PRECEDING AND CURRENT ROW
    ) AS window_column_alias
  FROM table_name;
  ```
- Enables calculations involving the current row and up to `N` preceding rows, such as moving averages or cumulative sums for a fixed number of rows.

### 🔑 Key Concepts
- **📊 Business Terms**: 
  - Rolling Window: Moving period of analysis
  - Sequential Analysis: Study of consecutive transactions
  - Moving Average: Average over a sliding timeframe
- **💡 Why It Matters**: Reveals trends by smoothing out daily fluctuations
    - Shows short-term patterns in customer behavior
    - Helps identify seasonal or cyclical trends
    - Identifies mid-term trends in net revenue, such as monthly purchasing patterns.
- **🎯 Common Use Cases**: Trend analysis, pattern detection
- **📈 Related KPIs**: Rolling revenue, moving averages

### 📈 Analysis


- Computes the preceding monthly average net revenue.

### Monthly Sales Analysis - Preceding Monthly Average

**`N PRECEDING`**

1. Calculate monthly revenue for 2023
   - Extract month from orderdate using `TO_CHAR()`
   - Calculate revenue using `quantity * netprice * exchangerate`
   - Filter for year 2023
   - Group and order by month

In [48]:
%%sql

WITH monthly_sales AS (
    SELECT 
        TO_CHAR(orderdate, 'YYYY-MM') as month,
        SUM(quantity * netprice * exchangerate) as net_revenue
    FROM sales
    WHERE EXTRACT(YEAR FROM orderdate) = 2023
    GROUP BY month
    ORDER BY month
    
)
SELECT 
    month,
    net_revenue,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS BETWEEN 1 PRECEDING AND CURRENT ROW -- sub in 0 PRECEDING
        ) as net_revenue_preceding
FROM monthly_sales;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

12 rows affected.

      month  net_revenue  net_revenue_preceding
0   2023-01   3664431.34             3664431.34
1   2023-02   4465204.57             4064817.96
2   2023-03   2244316.52             3354760.54
3   2023-04   1162796.16             1703556.34
4   2023-05   2943005.99             2052901.08
5   2023-06   2864500.03             2903753.01
6   2023-07   2337639.34             2601069.68
7   2023-08   2623919.79             2480779.57
8   2023-09   2622774.85             2623347.32
9   2023-10   2551322.61             2587048.73
10  2023-11   2700103.38             2625712.99
11  2023-12   2928550.93             2814327.15

Let's see how changing the PRECEDING value affects the average:

> With `1 PRECEDING`: `AVG = (current_month + prev_month) / 2`  
> With `2 PRECEDING`: `AVG = (current_month + prev_month_1 + prev_month_2) / 3`  
> With `3 PRECEDING`: `AVG = (current_month + prev_month_1 + prev_month_2 + prev_month_3) / 4`

In [49]:
%%sql

WITH monthly_sales AS (
    SELECT 
        TO_CHAR(orderdate, 'YYYY-MM') as month,
        SUM(quantity * netprice * exchangerate) as net_revenue
    FROM sales
    WHERE EXTRACT(YEAR FROM orderdate) = 2023
    GROUP BY month
    ORDER BY month
    
)
SELECT 
    month,
    net_revenue,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS BETWEEN 1 PRECEDING AND CURRENT ROW
        ) as net_revenue_preceding_1,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS BETWEEN 2 PRECEDING AND CURRENT ROW
        ) as net_revenue_preceding_2,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS BETWEEN 3 PRECEDING AND CURRENT ROW
        ) as net_revenue_preceding_3
FROM monthly_sales;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

12 rows affected.

,month,net_revenue,net_revenue_preceding_1,net_revenue_preceding_2,net_revenue_preceding_3
0,2023-01,3664431.34,3664431.34,3664431.34,3664431.34
1,2023-02,4465204.57,4064817.96,4064817.96,4064817.96
2,2023-03,2244316.52,3354760.54,3457984.14,3457984.14
3,2023-04,1162796.16,1703556.34,2624105.75,2884187.15
4,2023-05,2943005.99,2052901.08,2116706.22,2703830.81
5,2023-06,2864500.03,2903753.01,2323434.06,2303654.68
6,2023-07,2337639.34,2601069.68,2715048.45,2326985.38
7,2023-08,2623919.79,2480779.57,2608686.39,2692266.29
8,2023-09,2622774.85,2623347.32,2528111.33,2612208.50
9,2023-10,2551322.61,2587048.73,2599339.08,2533914.15
10,2023-11,2700103.38,2625712.99,2624733.61,2624530.16
11,2023-12,2928550.93,2814327.15,2726658.97,2700687.94

<img src="../Resources/images/3.5_precede_rev.png" alt="Cohort Rolling 3 Month Revenue" width="50%">
<img src="../Resources/images/3.5_preced_rev_3.png" alt="Cohort Rolling 3 Month Revenue" width="50%">

---
## N FOLLOWING

### 📝 Notes

`N FOLLOWING`

- **N FOLLOWING**: Refers to `N` rows after the current row in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN CURRENT ROW AND N FOLLOWING
    ) AS window_column_alias
  FROM table_name;
  ```
- Useful for calculating aggregations involving the current row and a specified number of subsequent rows, such as projecting future totals or averages.

### 🔑 Key Concepts
- **📊 Business Terms**: 
  - Forward Analysis: Looking at upcoming transactions
  - Future Value: Revenue from subsequent orders
  - Predictive Window: Period of future analysis
- **💡 Why It Matters**: Projects short-term future performance
    - Anticipates upcoming revenue patterns
    - Identifies potential changes in customer behavior
    - Useful for forecasting and identifying patterns in purchasing activity after a given month.
- **🎯 Common Use Cases**: Short-term forecasting, trend prediction
- **📈 Related KPIs**: Forward revenue, future order value

### 📈 Analysis

- Returns the 3 month rolling average net revenue.

### Monthly Sales Analysis - 3 Month Rolling Average

**`PRECEDING`**

1. Calculate the average net revenue for the previous month and current month using `1 PRECEDING AND CURRENT ROW`
   - Use `AVG(net_revenue)` to calculate the average revenue 
   - Apply `ROWS BETWEEN 1 PRECEDING AND CURRENT ROW` to include previous month and current month
   - Formula: `AVG(net_revenue) OVER (ORDER BY month ROWS BETWEEN 1 PRECEDING AND CURRENT ROW)`

In [58]:
%%sql

WITH monthly_sales AS (
    SELECT 
        TO_CHAR(orderdate, 'YYYY-MM') as month,
        SUM(quantity * netprice * exchangerate) as net_revenue
    FROM sales
    WHERE EXTRACT(YEAR FROM orderdate) = 2023
    GROUP BY month
    ORDER BY month
    
)
SELECT 
    month,
    net_revenue,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS BETWEEN 1 PRECEDING AND CURRENT ROW
        ) as net_revenue_preceding,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS BETWEEN CURRENT ROW AND 1 FOLLOWING -- sub in 0 FOLLOWING
        ) as net_revenue_following
FROM monthly_sales;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

12 rows affected.

      month  net_revenue  net_revenue_preceding  net_revenue_following
0   2023-01   3664431.34             3664431.34             4064817.96
1   2023-02   4465204.57             4064817.96             3354760.54
2   2023-03   2244316.52             3354760.54             1703556.34
3   2023-04   1162796.16             1703556.34             2052901.08
4   2023-05   2943005.99             2052901.08             2903753.01
5   2023-06   2864500.03             2903753.01             2601069.68
6   2023-07   2337639.34             2601069.68             2480779.57
7   2023-08   2623919.79             2480779.57             2623347.32
8   2023-09   2622774.85             2623347.32             2587048.73
9   2023-10   2551322.61             2587048.73             2625712.99
10  2023-11   2700103.38             2625712.99             2814327.15
11  2023-12   2928550.93             2814327.15             2928550.93

2. Calculate the rolling average net revenue for each month using a 3-month window centered on the current month:
    - Use `AVG(net_revenue)` to calculate the average revenue
    - Apply `ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING` to include:
    - Previous month (1 PRECEDING)
    - Current month (CURRENT ROW) 
    - Next month (1 FOLLOWING)
    - Formula: `AVG(net_revenue) OVER (ORDER BY month ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING)`

In [57]:
%%sql

WITH monthly_sales AS (
    SELECT 
        TO_CHAR(orderdate, 'YYYY-MM') as month,
        SUM(quantity * netprice * exchangerate) as net_revenue
    FROM sales
    WHERE EXTRACT(YEAR FROM orderdate) = 2023
    GROUP BY month
    ORDER BY month
    
)
SELECT 
    month,
    net_revenue,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING
        ) as net_revenue_rolling
FROM monthly_sales;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

12 rows affected.

      month  net_revenue  net_revenue_rolling
0   2023-01   3664431.34           4064817.96
1   2023-02   4465204.57           3457984.14
2   2023-03   2244316.52           2624105.75
3   2023-04   1162796.16           2116706.22
4   2023-05   2943005.99           2323434.06
5   2023-06   2864500.03           2715048.45
6   2023-07   2337639.34           2608686.39
7   2023-08   2623919.79           2528111.33
8   2023-09   2622774.85           2599339.08
9   2023-10   2551322.61           2624733.61
10  2023-11   2700103.38           2726658.97
11  2023-12   2928550.93           2814327.15

<img src="../Resources/images/3.5_rolling_rev.png" alt="3 Month Rolling Revenue" width="50%">

---
## UNBOUNDED

### 📝 Notes

`UNBOUNDED PRECEDING`

- **UNBOUNDED PRECEDING**: Refers to the first row of the partition or dataset in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW
    ) AS window_column_alias
  FROM table_name;
  ```
- Commonly used for cumulative calculations starting from the beginning of a partition, such as running totals or cumulative averages.

`UNBOUNDED FOLLOWING`

- **UNBOUNDED FOLLOWING**: Refers to the last row of the partition or dataset in a window frame.
- Syntax:
  ```sql
  SELECT
    column_name,
    SUM(column_name) OVER(
        PARTITION BY partition_expression
        ORDER BY order_expression
        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING
    ) AS window_column_alias
  FROM table_name;
  ```
- Often used to aggregate values from the current row to the end of the partition, such as totals or counts of future data.

### 🔑 Key Concepts
- **📊 Business Terms**: 
  - Cumulative Total: Running sum of all values
  - Historical Performance: Complete transaction history
  - Aggregate Growth: Total accumulation over time
- **💡 Why It Matters**: Shows complete historical performance
    - Tracks long-term cohort growth and overall net revenue contributions over time.
    - Assists in understanding future net revenue potential from a given point in time.
- **🎯 Common Use Cases**: Growth analysis, performance tracking
- **📈 Related KPIs**: Total revenue, growth rate

### 📈 Analysis

- Calculates average revenue across all months
- Get the cumulative monthly averages for 2023
- Compares last month and third month revenues

### Monthly Sales Analysis

**`UNBOUNDED PRECEDING` & `UNBOUNDED FOLLOWING`**

1. Calculate the total average net revenue across all months using an UNBOUNDED window:
    - Use `AVG(net_revenue)` to calculate the average revenue
    - Apply `ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING` to include:
        - All previous months (UNBOUNDED PRECEDING)
        - Current month (implicitly included)
        - All following months (UNBOUNDED FOLLOWING)
    - Formula: `AVG(net_revenue) OVER (ORDER BY month ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING)`

In [60]:
%%sql

WITH monthly_sales AS (
    SELECT 
        TO_CHAR(orderdate, 'YYYY-MM') as month,
        SUM(quantity * netprice * exchangerate) as net_revenue
    FROM sales
    WHERE EXTRACT(YEAR FROM orderdate) = 2023
    GROUP BY month
    ORDER BY month
    
)
SELECT 
    month,
    net_revenue,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
        ) as net_revenue_rolling
FROM monthly_sales;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

12 rows affected.

      month  net_revenue  net_revenue_rolling
0   2023-01   3664431.34           2759047.13
1   2023-02   4465204.57           2759047.13
2   2023-03   2244316.52           2759047.13
3   2023-04   1162796.16           2759047.13
4   2023-05   2943005.99           2759047.13
5   2023-06   2864500.03           2759047.13
6   2023-07   2337639.34           2759047.13
7   2023-08   2623919.79           2759047.13
8   2023-09   2622774.85           2759047.13
9   2023-10   2551322.61           2759047.13
10  2023-11   2700103.38           2759047.13
11  2023-12   2928550.93           2759047.13

2. Calculate the cumulative average net revenue using a running window:
    - Use `AVG(net_revenue)` to calculate the average revenue
    - Apply `ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW` to include:
        - All previous months (UNBOUNDED PRECEDING)
        - Current month (CURRENT ROW)
        - No future months included
    - Formula: `AVG(net_revenue) OVER (ORDER BY month ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW)`

In [61]:
%%sql

WITH monthly_sales AS (
    SELECT 
        TO_CHAR(orderdate, 'YYYY-MM') as month,
        SUM(quantity * netprice * exchangerate) as net_revenue
    FROM sales
    WHERE EXTRACT(YEAR FROM orderdate) = 2023
    GROUP BY month
    ORDER BY month
    
)
SELECT 
    month,
    net_revenue,
    AVG(net_revenue) OVER (
        ORDER BY month
        ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW  -- CURRENT ROW AND UNBOUNDED PRECEDING
        ) as net_revenue_rolling
FROM monthly_sales;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

12 rows affected.

      month  net_revenue  net_revenue_rolling
0   2023-01   3664431.34           3664431.34
1   2023-02   4465204.57           4064817.96
2   2023-03   2244316.52           3457984.14
3   2023-04   1162796.16           2884187.15
4   2023-05   2943005.99           2895950.92
5   2023-06   2864500.03           2890709.10
6   2023-07   2337639.34           2811699.14
7   2023-08   2623919.79           2788226.72
8   2023-09   2622774.85           2769843.18
9   2023-10   2551322.61           2747991.12
10  2023-11   2700103.38           2743637.69
11  2023-12   2928550.93           2759047.13

3. Calculate different positional revenue values using different window frames:
    - Use `LAST_VALUE(net_revenue)` to compare default vs unbounded window:
        - Default frame (current row only)
        - All months frame (UNBOUNDED PRECEDING TO UNBOUNDED FOLLOWING)
        - `LAST_VALUE(net_revenue) OVER (ORDER BY month ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING)`
    - Use `NTH_VALUE(net_revenue, 3)` to compare third month revenue:
        - Default frame (current row only)
        - All months frame (UNBOUNDED PRECEDING TO UNBOUNDED FOLLOWING)
        - `NTH_VALUE(net_revenue, 3) OVER (ORDER BY month ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING)`

In [64]:
%%sql

WITH monthly_sales AS (
    SELECT 
        TO_CHAR(orderdate, 'YYYY-MM') as month,
        SUM(quantity * netprice * exchangerate) as net_revenue
    FROM sales
    WHERE EXTRACT(YEAR FROM orderdate) = 2023
    GROUP BY month
    ORDER BY month
)
SELECT 
    month,
    net_revenue,
    LAST_VALUE(net_revenue) OVER (ORDER BY month) as last_month_revenue,
    LAST_VALUE(net_revenue) OVER (
        ORDER BY month 
        ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
        ) as last_month_revenue_unbound,
    NTH_VALUE(net_revenue, 3) OVER (ORDER BY month) as third_month_revenue_unbound,
    NTH_VALUE(net_revenue, 3) OVER (
        ORDER BY month 
        ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING
        ) as third_month_revenue
FROM monthly_sales;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

12 rows affected.

,month,net_revenue,last_month_revenue,last_month_revenue_unbound,third_month_revenue_unbound,third_month_revenue
0,2023-01,3664431.34,3664431.34,2928550.93,NaN,2244316.52
1,2023-02,4465204.57,4465204.57,2928550.93,NaN,2244316.52
2,2023-03,2244316.52,2244316.52,2928550.93,2244316.52,2244316.52
3,2023-04,1162796.16,1162796.16,2928550.93,2244316.52,2244316.52
4,2023-05,2943005.99,2943005.99,2928550.93,2244316.52,2244316.52
5,2023-06,2864500.03,2864500.03,2928550.93,2244316.52,2244316.52
6,2023-07,2337639.34,2337639.34,2928550.93,2244316.52,2244316.52
7,2023-08,2623919.79,2623919.79,2928550.93,2244316.52,2244316.52
8,2023-09,2622774.85,2622774.85,2928550.93,2244316.52,2244316.52
9,2023-10,2551322.61,2551322.61,2928550.93,2244316.52,2244316.52
10,2023-11,2700103.38,2700103.38,2928550.93,2244316.52,2244316.52
11,2023-12,2928550.93,2928550.93,2928550.93,2244316.52,2244316.52